preferences.step.by.step.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>preferences.step.by.step</title>
<!-- 2014-04-24 Thu 11:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">preferences.step.by.step</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. </a></li>
<li><a href="#sec-2">2. Skim </a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="http://developer.android.com/guide/topics/ui/settings.html">http://developer.android.com/guide/topics/ui/settings.html</a></h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><code>[1/1]</code> Define the preference in an XML file
<ol class="org-ol">
<li><code>[X]</code> <a href="file:///home/troy/workspace/MyFirstApp/res/xml/preferences.xml">file:///home/troy/workspace/MyFirstApp/res/xml/preferences.xml</a> 
        <a href="http://developer.android.com/guide/topics/ui/settings.html#Activity">http://developer.android.com/guide/topics/ui/settings.html#Activity</a>
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #a020f0;">xml</span> <span style="color: #a0522d;">version</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">1.0</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">encoding</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">utf-8</span><span style="color: #8b2252;">"</span>?&gt;
&lt;<span style="color: #0000ff;">PreferenceScreen</span> <span style="color: #483d8b;">xmlns</span>:<span style="color: #a0522d;">android</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">http://schemas.android.com/apk/res/android</span><span style="color: #8b2252;">"</span> &gt;

  &lt;<span style="color: #0000ff;">EditTextPreference</span>
      <span style="color: #483d8b;">android</span>:<span style="color: #a0522d;">persistent</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">true</span><span style="color: #8b2252;">"</span>
      <span style="color: #483d8b;">android</span>:<span style="color: #a0522d;">defaultValue</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">+19094479170</span><span style="color: #8b2252;">"</span>
      <span style="color: #483d8b;">android</span>:<span style="color: #a0522d;">key</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ref_PhoneNumber</span><span style="color: #8b2252;">"</span>
      <span style="color: #483d8b;">android</span>:<span style="color: #a0522d;">summary</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">Enter SMS Phone Number</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">android</span>:<span style="color: #a0522d;">dialogTitle</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">Enter Phone Number</span><span style="color: #8b2252;">"</span>
      <span style="color: #483d8b;">android</span>:<span style="color: #a0522d;">title</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">Phone Number</span><span style="color: #8b2252;">"</span> /&gt;
&lt;/<span style="color: #0000ff;">PreferenceScreen</span>&gt;
</pre>
</div>
</li>
</ol>
</li>
<li><code>[X]</code> <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/SettingsFragment.java">file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/SettingsFragment.java</a>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #a020f0;">package</span> com.example.<span style="color: #008b8b;">myfirstapp</span>;

<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">android</span>.<span style="color: #008b8b;">os</span>.<span style="color: #228b22;">Bundle</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">android</span>.<span style="color: #008b8b;">preference</span>.<span style="color: #228b22;">PreferenceFragment</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">android</span>.<span style="color: #008b8b;">widget</span>.<span style="color: #228b22;">Toast</span>;

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">SettingsFragment</span> <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">PreferenceFragment</span> {

    <span style="color: #008b8b;">@Override</span>
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">onCreate</span>(<span style="color: #228b22;">Bundle</span> <span style="color: #a0522d;">savedInstanceState</span>)
    {
        <span style="color: #a020f0;">super</span>.onCreate(savedInstanceState);
        <span style="color: #b22222;">// </span><span style="color: #b22222;">Toast.makeText(null, "SettingsActivity.java", Toast.LENGTH_LONG).show();</span>
        addPreferencesFromResource(R.xml.preferences);
    }
}
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/SettingsActivity.java">file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/SettingsActivity.java</a>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #a020f0;">package</span> com.example.<span style="color: #008b8b;">myfirstapp</span>;

<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">android</span>.<span style="color: #008b8b;">app</span>.<span style="color: #228b22;">Activity</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">android</span>.<span style="color: #008b8b;">os</span>.<span style="color: #228b22;">Bundle</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">android</span>.<span style="color: #008b8b;">widget</span>.<span style="color: #228b22;">Toast</span>;

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">SettingsActivity</span> <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Activity</span> {

    <span style="color: #008b8b;">@Override</span>
    <span style="color: #a020f0;">protected</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">onCreate</span>(<span style="color: #228b22;">Bundle</span> <span style="color: #a0522d;">savedInstanceState</span>)
    {
        <span style="color: #a020f0;">super</span>.onCreate(savedInstanceState);
        setContentView(R.layout.activity_settings);
        <span style="color: #b22222;">//      </span><span style="color: #b22222;">Toast.makeText(getApplicationContext(), "SettingsActivity.java", Toast.LENGTH_LONG).show();</span>
    }

}
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java">file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java</a>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">MainActivity</span> <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Activity</span> {

    <span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #a020f0;">final</span> <span style="color: #228b22;">String</span> <span style="color: #a0522d;">PHONE</span> = <span style="color: #8b2252;">"pref_PhoneNumber"</span>;

    <span style="color: #008b8b;">@Override</span>
    <span style="color: #a020f0;">protected</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">onCreate</span>(<span style="color: #228b22;">Bundle</span> <span style="color: #a0522d;">savedInstanceState</span>) {
        <span style="color: #a020f0;">super</span>.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        PreferenceManager.setDefaultValues(<span style="color: #a020f0;">this</span>,R.xml.preferences,<span style="color: #008b8b;">false</span>);

        PreferenceManager.getDefaultSharedPreferences(<span style="color: #a020f0;">this</span>);
        <span style="color: #b22222;">//              </span><span style="color: #b22222;">registerOnSharedPreferencesChangeListener(preferenceChangeListener);</span>

        <span style="color: #a020f0;">if</span> (savedInstanceState == <span style="color: #008b8b;">null</span>) {
            getFragmentManager().beginTransaction()
                .add(R.id.container, <span style="color: #a020f0;">new</span> <span style="color: #228b22;">PlaceholderFragment</span>()).commit();
        }
    }

    <span style="color: #008b8b;">@Override</span>
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">boolean</span> <span style="color: #0000ff;">onCreateOptionsMenu</span>(<span style="color: #228b22;">Menu</span> <span style="color: #a0522d;">menu</span>) {

        <span style="color: #b22222;">// </span><span style="color: #b22222;">Inflate the menu; this adds items to the action bar if it is present.</span>
        getMenuInflater().inflate(R.menu.main, menu);
        <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">true</span>;
    }

    <span style="color: #008b8b;">@Override</span>
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">boolean</span> <span style="color: #0000ff;">onOptionsItemSelected</span>(<span style="color: #228b22;">MenuItem</span> <span style="color: #a0522d;">item</span>) {
        <span style="color: #b22222;">// </span><span style="color: #b22222;">int id = item.getItemId();</span>
        <span style="color: #b22222;">// </span><span style="color: #b22222;">if (id == R.id.action_settings) {</span>
        <span style="color: #b22222;">//      </span><span style="color: #b22222;">return true;</span>
        <span style="color: #b22222;">// </span><span style="color: #b22222;">}</span>

        Toast.makeText(getApplicationContext(), <span style="color: #8b2252;">"MainActivity.java"</span>, <span style="color: #008b8b;">Toast</span>.LENGTH_LONG).show();

        <span style="color: #228b22;">Intent</span> <span style="color: #a0522d;">preferencesIntent</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Intent</span>(<span style="color: #a020f0;">this</span>, SettingsActivity.<span style="color: #a020f0;">class</span>);
        startActivity(preferencesIntent);
        <span style="color: #a020f0;">return</span> <span style="color: #a020f0;">super</span>.onOptionsItemSelected(item);
    }

    <span style="color: #8b2252;">/**</span>
<span style="color: #8b2252;">     * A placeholder fragment containing a simple view.</span>
<span style="color: #8b2252;">     */</span>
    <span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">PlaceholderFragment</span> <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Fragment</span> {

        <span style="color: #a020f0;">public</span> PlaceholderFragment() {
        }

        <span style="color: #008b8b;">@Override</span>
        <span style="color: #a020f0;">public</span> <span style="color: #228b22;">View</span> <span style="color: #0000ff;">onCreateView</span>(<span style="color: #228b22;">LayoutInflater</span> <span style="color: #a0522d;">inflater</span>, <span style="color: #228b22;">ViewGroup</span> <span style="color: #a0522d;">container</span>,
                                 <span style="color: #228b22;">Bundle</span> <span style="color: #a0522d;">savedInstanceState</span>) {
            <span style="color: #228b22;">View</span> <span style="color: #a0522d;">rootView</span> = inflater.inflate(R.layout.fragment_main, container,
                                             <span style="color: #008b8b;">false</span>);
            <span style="color: #a020f0;">return</span> rootView;
        }
    }

}
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Skim <a href="http://developer.android.com/guide/topics/ui/settings.html">http://developer.android.com/guide/topics/ui/settings.html</a></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2014-04-24 Thu 11:23</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5f)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
